// Да се напише функция, която получава час и минути от 24-часово денонощие и изчислява колко ще е часът след 15 минути. 
// Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. 
// Часовете се изписват с една или две цифри. 
// Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо.

function timePlus(hours, minutes) {

    minutes = minutes + 15;

    if (minutes > 60) {
        hours ++;
        minutes = minutes - 60;
    }

    if (hours >= 24) {
        hours = hours - 24;
    }


    if (minutes < 10) {
        console.log(`${hours}:0${minutes}`);

    } else {
        console.log(`${hours}:${minutes}`);
    }
}

timePlus(23, 59);